<template>
    <div id="information">
        <div class="d-flex justify-space-around flex-wrap mt-5">
            <div class="md5">
                <div class="d-flex justify-center">
                    <svg style="width:150px;height:150px" viewBox="0 0 24 24" color="brown">
                        <path fill="currentColor"
                              d="M19 15H17V13H19M20 20V22H16V20H17V18H16V16H19V20M18.92 5A1.5 1.5 0 0 0 17.5 4H6.5A1.5 1.5 0 0 0 5.08 5L3 11V19A1 1 0 0 0 4 20H5A1 1 0 0 0 6 19V18H11A7 7 0 0 1 18 11A6.84 6.84 0 0 1 21 11.68V11M6.5 15A1.5 1.5 0 1 1 8 13.5A1.5 1.5 0 0 1 6.5 15M5 10L6.5 5.5H17.5L19 10Z"/>
                    </svg>
                </div>
                <h2 class="text-center">На замітку водіям</h2>
            </div>
            <div class=" md5">
                <img class="info-img" src="../assets/img/info.jpg" alt="Info"/>
            </div>
        </div>
        <div class="d-flex justify-center">
            <div class="information mt-3">
                <div>
                    <h3 class="ml-2">Відповідальна особа:</h3>
                    <h4 class="ml-5 mb-3">для авто на українській реєстрації:</h4>
                    <ul v-for="(person, i) of persons" :key="i">
                        <li class="text-justify mr-3 mb-3">{{person}}</li>
                    </ul>
                    <h4 class="ml-5 mb-3">для авто, що зареєстровано за межами території України:
                    </h4>
                    <ul>
                        <li class="text-justify mr-3 mb-3">Особа, яка ввезла такий транспортний засіб на територію
                            України.
                        </li>
                    </ul>
                    <div class="d-flex justify-center">
                        <v-btn href="http://zakon.rada.gov.ua/laws/show/80731-10#n3865" target="_blank" color="primary"
                               class="ma-3">Посилання
                            <v-icon class="ml-2">mdi-send</v-icon>
                        </v-btn>
                    </div>
                </div>

                <div>
                    <ul>
                        <li class="text-justify mr-3 mb-3">Уразі сплати 50 відсотків розміру штрафу протягом 10
                            банківських
                            днів з дня набрання законної сили постановою, така постанова вважається виконаною.
                        </li>
                        <li class="text-justify mr-3 mb-3">Постанова також вважається виконаною у разі сплати штрафу за
                            повідомленням залишеним на лобовому склі транспортного засобу, у тому числі шляхом сплати 50
                            відсотків розміру штрафу протягом 10 банківських днів з дня вчинення відповідного
                            правопорушення.
                        </li>
                        <li class="text-justify mr-3 mb-3">У разі несплати штрафу протягом 30 днів з дня набрання
                            законної
                            сили постановою така постанова підлягає примусовому виконанню.
                        </li>
                    </ul>
                    <div class="d-flex justify-center">
                        <v-btn href="https://zakon.rada.gov.ua/laws/show/2262-19#n149" target="_blank" color="primary"
                               class="ma-3">Посилання
                            <v-icon class="ml-2">mdi-send</v-icon>
                        </v-btn>
                    </div>
                </div>

                <div>
                    <h3 class="ml-5 mb-3 mt-3">Якщо автомобіль вибув з вашого володіння:</h3>
                    <ul>
                        <li class="text-justify mr-3 mb-3">такий був проданий по дорученню</li>
                        <li class="text-justify mr-3 mb-3">такий був проданий по технічному паспорту</li>
                        <p class="text-justify mr-3"><small> прохання звернутись в
                            Територіальний сервісний центр МВС України і написати заяву з наданням
                            відповідних відомостей щодо належного користувача транспортного (хто на
                            даний час керує цим транспортним засобом) в іншому випадку до
                            адміністративної відповідальності буде притягнуто власника такого
                            транспортного засобу.</small>
                        </p>
                    </ul>
                </div>

                <div>
                    <h3 class="ml-5 mb-3 mt-3">Необхідні документи для вилучення автівки зі штрафмайданчику.</h3>
                    <h4 class="ml-5 mb-3">Які документи потрібні щоб забрати машину?</h4>
                    <p class="ml-5 mb-3"><b>Для того, щоб забрати своє авто потрібно мати:</b></p>
                    <ul>
                        <li class="mb-3 mr-3 text-justify">Сплачені квитанції:
                            <ul>
                                <li>транспортування транспортного засобу на спеціальний майданчик</li>
                                <li>зберігання транспортного засобу на спеціальному майданчику</li>
                                <li>штраф за порушення ПДР</li>
                            </ul>
                        </li>
                        <li class="mb-3">Свідоцтво про реєстрацію транспортного засобую.</li>
                        <li class="mb-3">Водійське посвідчення.</li>
                    </ul>
                </div>

            </div>
        </div>
        <div class="d-flex justify-center ">
            <div class="d-flex justify-center flex-column pa-3 ma-3  grey lighten-3">
                <h3 class="text-center mb-2">Реквізити для оплати штрафу</h3>
                <p>Отримувач: УКуГалиць.р м.Льв./Галицький/21081100</p>
                <p>Код отримувача (ЄДРПОУ) – 38007573</p>
                <p>Банк отримувача – Казначейство України (ЕАП)</p>
                <p>Номер рахунку – UA068999980314070542000013004</p>
                <p>Адміністративні штрафи та інші санкції</p>
                <p>Призначення платежу: оплата штрафу згідно постанови ЛВ№______ від___________року.</p>
                <p>ДНЗ (державний номерний знак авто) _________________.</p>
                <p>Платник (Прізвище, ініціали) ____________________________.</p>
                <p>Сума платежу: _________________ гривень.</p>
            </div>
        </div>
    </div>
</template>

<script>
  export default {
    data: () => ({
      persons: [
        'Фізична особа, за якою зареєстровано транспортний засіб.',
        'Керівник юридичної особи, за якою зареєстровано транспортний засіб.',
        'Належний користувач транспортного засобу, якщо до Єдиного державного реєстру транспортних засобів внесено відомості про належного користувач відповідного транспортного засобу.',
        'Особа, яка виконує повноваження керівника такої юридичної особи, якщо в Єдиному державному реєстрі юридичних осіб, фізичних осіб - підприємців та громадських формувань відсутні на момент запиту відомості про керівника юридичної особи, за якою зареєстрований транспортний засіб.'
      ]
    })
  }
</script>

<style scoped>
    .information {
        max-width: 900px;
    }

    .info-img {
        max-width: 300px;
        max-height: 300px;
    }
</style>
